Revit 2026 API

# BeamSystemCreate(Document, IListCurve, SketchPlane, XYZ, Boolean) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static BeamSystem Create(
	Document document,
	IList<Curve> profile,
	SketchPlane sketchPlane,
	XYZ direction,
	bool is3d
)
```
```vb
Public Shared Function Create (
	document As Document,
	profile As IList(Of Curve),
	sketchPlane As SketchPlane,
	direction As XYZ,
	is3d As Boolean
) As BeamSystem
```
```cpp
public:
static BeamSystem^ Create(
	Document^ document,
	IList<Curve^>^ profile,
	SketchPlane^ sketchPlane,
	XYZ^ direction,
	bool is3d
)
```
```fsharp
static member Create :
        document : Document *
        profile : IList<Curve> *
        sketchPlane : SketchPlane *
        direction : XYZ *
        is3d : bool -> BeamSystem
```

#### Parameters

document Document

profile IListCurve

sketchPlane SketchPlane

direction XYZ

is3d Boolean

#### Return Value

BeamSystem

#### Reference

BeamSystem Class

Create Overload

Autodesk.Revit.DB Namespace